{
  "backend/main.mo": "Defines an actor that stores interest list entries and adds new ones unless an email/name duplicate is found.",
  "feature_evidence.json": "Feature evidence report describing removal of Oregon flower decorations on the Home page and listing affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files, describing each page, component, hook, and config.",
  "frontend/DEPLOYMENT_NOTES.md": "Deployment checklist covering route setup, visual checks for Little Sprouts content, flyer loading, and handbook download behavior.",
  "frontend/index.css": "Global Tailwind base and theme variable definitions using OKLCH colors for light and dark modes.",
  "frontend/index.html": "HTML entry file that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router with SiteLayout and seven routes including Little Sprouts.",
  "frontend/src/components/InterestListForm.tsx": "Form component handling validation and submission of interest list entries to the backend actor.",
  "frontend/src/components/ParentHandbookAccordion.tsx": "Accordion component listing handbook sections with titles and short descriptions.",
  "frontend/src/components/SiteLayout.tsx": "Layout wrapper rendering the TopNav and routed page content.",
  "frontend/src/components/TopNav.tsx": "Sticky navigation bar using shadcn components with links to all site routes.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching an authenticated or anonymous backend actor and refreshing queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks with no current functionality.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light and dark theme CSS variables along with base typography and utility styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider before rendering.",
  "frontend/src/pages/AboutPage.tsx": "Static page describing the preschool’s philosophy, garden-based learning model, language approach, and program leadership.",
  "frontend/src/pages/ContactInterestListPage.tsx": "Displays the interest list form for the 2027 program and provides basic contact information with email link.",
  "frontend/src/pages/HomePage.tsx": "Homepage featuring the Little Sprouts Garden Club overview and initial preschool opening section with visuals and details.",
  "frontend/src/pages/LittleSproutsPage.tsx": "Provides detailed information about the Little Sprouts preschool garden club, including program overview, schedule, and activities.",
  "frontend/src/pages/ParentHandbookPage.tsx": "Shows parent handbook information with a downloadable PDF check, accordion sections, and regulatory compliance notice.",
  "frontend/src/pages/ProgramPage.tsx": "Renders the Program page with sections describing program details, curriculum, outdoor learning, and inclusion values.",
  "frontend/src/pages/TuitionPage.tsx": "Renders the Tuition page showing tuition policies, projected rates, and included services.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, spacing, and plugin integrations.",
  "project_state.json": "Stores project state metadata including features, requests, and project configuration."
}